app/controllers/stocks_controller.rb

  def search
    if (params[:stock])
      @stock = Stock.find_by_ticker(params[:stock])
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker" = $1 ORDER BY "stocks"."id" ASC LIMIT $2  [["ticker", "Goog"], ["LIMIT", 1]]