app/controllers/users_controller.rb

  def create

    tempUser = User.find_by_username(params[:username])

    if tempUser
      puts "Username is already taken."
      puts "++++++++++++++++++++++++++++++++"
      render json: {error: "The username is already taken."}
    else

          hashed_password = BCrypt::Password.create(params[:password])
          @user = User.new(user_params)
          @user.name = params[:name]
          @user.username = params[:username]
          @user.password = hashed_password
          @user.money = 10000

          if @user.save
---
INSERT INTO "users" ("name", "password", "money", "created_at", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Hoang"], ["password", "test"], ["money", "10000.0"], ["created_at", "2017-05-18 19:01:17.772064"], ["updated_at", "2017-05-18 19:01:17.772064"], ["username", "test"]]